Repository: JonatasGdeC/OKR
Catalog: src/OKR.Exception/ResourceErrorMessage.*.resx
Languages: es, fr, it, pt

# UNKNOWN_ERROR
source: Unknown erro.
es: Error desconocido.
fr: Erreur inconnue.
it: Errore sconosciuto.
pt: Erro desconhecido.

source: Title is required.
es: El título es obligatorio.
fr: Le titre est obligatoire.
it: Il titolo è obbligatorio.
pt: O título é obrigatório.

# OBJECTIVE_YEAR_IS_REQUIRED
source: Year is required.
es: El año es obligatorio.
fr: L'année est obligatoire.
it: L'anno è obbligatorio.
pt: O ano é obrigatório.

# OBJECTIVE_QUARTER_IS_REQUIRED
source: Quarter is required.
es: El trimestre es obligatorio.
fr: Le trimestre est obligatoire.
it: Il trimestre è obbligatorio.
pt: O trimestre é obrigatório.

# TITLE_MINIMUM_CHARACTERS
source: Title must have at least 3 characters.
es: El título debe tener al menos 3 caracteres.
fr: Le titre doit comporter au moins 3 caractères.
it: Il titolo deve essere lungo almeno 3 caratteri.
pt: O título deve ter pelo menos 3 caracteres.

# OBJECTIVE_TITLE_MAXIMUM_CHARACTERS
source: Title must have a maximum of 100 characters.
es: El título debe tener un máximo de 100 caracteres.
fr: Le titre doit comporter au maximum 100 caractères.
it: Il titolo deve contenere al massimo 100 caratteri.
pt: O título deve ter no máximo 100 caracteres.

# OBJECTIVE_YEAR_INVALID
source: Year must be the current year or next.
es: El año debe ser el año actual o el año siguiente.
fr: L'année doit être l'année en cours ou l'année suivante.
it: L'anno deve essere l'anno corrente o l'anno successivo.
pt: O ano deve ser o ano atual ou o próximo.

# OBJECTIVE_QUARTER_INVALID
source: Quarter must be between 1 and 4.
es: El trimestre debe estar entre 1 y 4.
fr: Le trimestre doit être compris entre 1 et 4.
it: Il trimestre deve essere compreso tra 1 e 4.
pt: The quarter must be between 1 and 4.

# OBJECTIVE_NOT_FOUND
source: Not found objective.
es: Objetivo no encontrado.
fr: Cible non trouvée.
it: Destinazione non trovata.
pt: Objetivo não encontrado.

# KEY_RESULT_TITLE_MAXIMUM_CHARACTERS
source: Title must have a maximum of 500 characters.
es: El título debe tener un máximo de 500 caracteres.
fr: Le titre doit comporter au maximum 500 caractères.
it: Il titolo deve contenere al massimo 500 caratteri.
pt: O título deve ter no máximo 500 caracteres.

# KEY_RESULT_NUMBER_IS_REQUIRED
source: The KR number is required.
es: El número KR es obligatorio.
fr: Le numéro KR est obligatoire.
it: Il numero KR è obbligatorio.
pt: O número da KR é obrigatório.

# KEY_RESULT_NUMBER_INVALID
source: The KR number must be greater than or equal to 1 and less than or equal to 5.
es: El número KR debe ser mayor o igual a 1 y menor o igual a 5.
fr: Le numéro KR doit être supérieur ou égal à 1 et inférieur ou égal à 5.
it: Il numero KR deve essere maggiore o uguale a 1 e minore o uguale a 5.
pt: O número da KR deve ser maior ou igual a 1 e menor ou igual a 5.

# KEY_RESULT_NUMBER_ALREADY_EXISTS
source: KR number already exists.
es: El número KR ya existe.
fr: Le numéro KR existe déjà.
it: Il numero KR esiste già.
pt: Número de KR já existe.

# KEY_RESULT_TITLE_ALREADY_EXISTS
source: The KR title already exists.
es: El título KR ya existe.
fr: Le titre KR existe déjà.
it: Il titolo KR esiste già.
pt: O título da KR já existe.

# OBJECTIVE_HAS_5_KEY_RESULT
source: The objective already has 5 KR.
es: El objetivo ya tiene 5 KR.
fr: L'objectif a déjà 5 KR.
it: L'obiettivo ha già 5 KR.
pt: O objetivo já possui 5 KR.

# KEY_RESULT_NOT_FOUND
source: Not found key result.
es: Resultado clave no encontrado.
fr: Résultat clé non trouvé.
it: Risultato chiave non trovato.
pt: Resultado chave não encontrado.
